app/controllers/authors_controller.rb

  def show
  #  @author = Author.find(params[:id])
    @authors = Author.all
---
SELECT "authors".* FROM "authors"